---
kind: other
id: Methods.T:Autodesk.Revit.DB.DesignOption
source: html/d5625e29-6df9-bc6c-8b18-feaf968734d4.htm
---
# DesignOption Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.